print('Введите сумму:')
summ = int(input())
if summ > 999999:
    print('Программа не работает с числами больше 999 999')

c6 = summ // 100000
c5 = (summ % 100000) // 10000
c4 = (summ % 10000) // 1000
c3 = (summ % 1000) // 100
c2 = (summ % 100) // 10
c1 = (summ % 10)
print(c6, c5, c4, c3, c2, c1)

c6t = ''
c5t = ''
c4t = ''
c3t = ''
c2t = ''
c1t = ''

if c6 == 9:
    c6t = 'девятьсот '
if c6 == 8:
    c6t = 'восемьсот '
if c6 == 7:
    c6t = 'семьсот '
if c6 == 6:
    c6t = 'шестьсот '
if c6 == 5:
    c6t = 'пятьсот '
if c6 == 4:
    c6t = 'четыреста '
if c6 == 3:
    c6t = 'триста '
if c6 == 2:
    c6t = 'двести '
if c6 == 1:
    c6t = 'сто '



if c4 == 9:
    c4t = 'девять '
if c4 == 8:
    c4t = 'восемь '
if c4 == 7:
    c4t = 'семь '
if c4 == 6:
    c4t = 'шесть '
if c4 == 5:
    c4t = 'пять '
if c4 == 4:
    c4t = 'четыре '
if c4 == 3:
    c4t = 'три '
if c4 == 2:
    c4t = 'два '
if c4 == 1:
    c4t = 'один '



if c5 == 9:
    c5t = 'девяносто '
if c5 == 8:
    c5t = 'восемьдесят '
if c5 == 7:
    c5t = 'семьдесят '
if c5 == 6:
    c5t = 'шестьдесят '
if c5 == 5:
    c5t = 'пятьдесят '
if c5 == 4:
    c5t = 'сорок '
if c5 == 3:
    c5t = 'тридцать '
if c5 == 2:
    c5t = 'двадцать '
if c5 == 1:
    if c4 == 9:
        c5t = 'девятнадцать '
        c4t = ''
    if c4 == 8:
        c5t = 'восемнадцать '
        c4t = ''
    if c4 == 7:
        c5t = 'семнадцать '
        c4t = ''
    if c4 == 6:
        c5t = 'шестнадцать '
        c4t = ''
    if c4 == 5:
        c5t = 'пятнадцать '
        c4t = ''
    if c4 == 4:
        c5t = 'четырнадцать '
        c4t = ''
    if c4 == 3:
        c5t = 'тринадцать '
        c4t = ''
    if c4 == 2:
        c5t = 'двенадцать '
        c4t = ''
    if c4 == 1:
        c5t = 'одиннадцать '
        c4t = ''

if c3 == 9:
    c3t = 'девятьсот '
if c3 == 8:
    c3t = 'восемьсот '
if c3 == 7:
    c3t = 'семьсот '
if c3 == 6:
    c3t = 'шестьсот '
if c3 == 5:
    c3t = 'пятьсот '
if c3 == 4:
    c3t = 'четыреста '
if c3 == 3:
    c3t = 'триста '
if c3 == 2:
    c3t = 'двести '
if c3 == 1:
    c3t = 'сто '



if c1 == 9:
    c1t = 'девять '
if c1 == 8:
    c1t = 'восемь '
if c1 == 7:
    c1t = 'семь '
if c1 == 6:
    c1t = 'шесть '
if c1 == 5:
    c1t = 'пять '
if c1 == 4:
    c1t = 'четыре '
if c1 == 3:
    c1t = 'три '
if c1 == 2:
    c1t = 'два '
if c1 == 1:
    c1t = 'один '



if c2 == 9:
    c2t = 'девяносто '
if c2 == 8:
    c2t = 'восемьдесят '
if c2 == 7:
    c2t = 'семьдесят '
if c2 == 6:
    c2t = 'шестьдесят '
if c2 == 5:
    c2t = 'пятьдесят '
if c2 == 4:
    c2t = 'сорок '
if c2 == 3:
    c2t = 'тридцать '
if c2 == 2:
    c2t = 'двадцать '
if c2 == 1:
    if c1 == 9:
        c2t = 'девятнадцать '
        c1t = ''
    if c1 == 8:
        c2t = 'восемнадцать '
        c1t = ''
    if c1 == 7:
        c2t = 'семнадцать '
        c1t = ''
    if c1 == 6:
        c2t = 'шестнадцать '
        c1t = ''
    if c1 == 5:
        c2t = 'пятнадцать '
        c1t = ''
    if c1 == 4:
        c2t = 'четырнадцать '
        c1t = ''
    if c1 == 3:
        c2t = 'тринадцать '
        c1t = ''
    if c1 == 2:
        c2t = 'двенадцать '
        c1t = ''
    if c1 == 1:
        c2t = 'одиннадцать '
        c1t = ''

if 5 <= c1 <= 9 or c1 == 0 or c1t == '':
    ending = 'рублей '
else:
    if 2 <= c1 <= 4:
        ending = 'рубля '
    else:
        if c1 == 1:
            ending = 'рубль '

if 4 < c4 < 10 or c4 == 0 or c4t == '':
    thousand = 'тысяч '
else:
    if 2 <= c4 <= 4:
        thousand = 'тысячи '
    else:
        if c4 == 1:
            thousand = 'тысяча '
if summ < 1000:
    thousand = ''

text = c6t + c5t + c4t + thousand + c3t + c2t + c1t + ending
print('Ваша сумма: ' + text.capitalize())